---
type: ParameterFilterRuleFactory
namespace: Autodesk.Revit.DB
version: 2024
members: 19
tags: [revit-api, class]
---

# ParameterFilterRuleFactory

`Autodesk.Revit.DB.ParameterFilterRuleFactory` · Revit 2024 · 19 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateBeginsWithRule | — | `` |
| Method | CreateContainsRule | — | `` |
| Method | CreateEndsWithRule | — | `` |
| Method | CreateEqualsRule | — | `` |
| Method | CreateGreaterOrEqualRule | — | `` |
| Method | CreateGreaterRule | — | `` |
| Method | CreateHasNoValueParameterRule | 2020 | `public static FilterRule CreateHasNoValueParameterRule ( ElementId parameter )` |
| Method | CreateHasValueParameterRule | 2020 | `public static FilterRule CreateHasValueParameterRule ( ElementId parameter )` |
| Method | CreateIsAssociatedWithGlobalParameterRule | 2011 | `public static FilterRule CreateIsAssociatedWithGlobalParameterRule ( ElementId parameter , ElementId value )` |
| Method | CreateIsNotAssociatedWithGlobalParameterRule | 2011 | `public static FilterRule CreateIsNotAssociatedWithGlobalParameterRule ( ElementId parameter , ElementId value )` |
| Method | CreateLessOrEqualRule | — | `` |
| Method | CreateLessRule | — | `` |
| Method | CreateNotBeginsWithRule | — | `` |
| Method | CreateNotContainsRule | — | `` |
| Method | CreateNotEndsWithRule | — | `` |
| Method | CreateNotEqualsRule | — | `` |
| Method | CreateSharedParameterApplicableRule | 2011 | `public static FilterRule CreateSharedParameterApplicableRule ( string parameterName )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |